package Inheritance;

public class B extends A { 
	 // Τα 'a' και 'void add(int x) {...}' υπονοούνται. 
	 int prev; 
	 void sub(int x) { 
	   prev = a; 
       a  -=  x; 
     } 
	 
	 
	 
	 //Είναι δυνατό οι μέθοδοι που ορίζονται στη Β να χρησιμοποιούν τα πεδία που
	 //δηλώθηκαν στην Α και να καλούν τις μεθόδους που ορίσθηκαν σ' αυτήν (την Α). Π.χ. 
     int square() { 
	   return a*a; 
	 } 
	 
	 void increaseBy1() { 
	   add(1); 
	 } 

	 
	 //Επιπλέον είναι δυνατό η κλάση Β να μεταβάλλει κάποια από τα ήδη υπάρχοντα
	 //πεδία ή μεθόδους. Για παράδειγμα :
	 
	 //Προσέξτε ότι η μέθοδος της Β που κάνει override  έχει το ίδιο όνομα,  λίστα
	 //παραμέτρων και επιστρεφόμενο τύπο με αυτήν της Α. Αν δεν είναι τα ίδια τότε δεν έχουμε
	 //υπερκάλυψη αλλά ορισμό μιας νέας μεθόδου.
	 
	 a : float;   // Αλλάζει τον τύπο της α. 
	  void add(int x) {  // Αλλάζει την add(int x). 
	          // Αυτό λέγεται overriding.
	     a = a + ((float) x); 
	     print(a); 
	   } 
	 
} 
