package Inheritance;

public class Overload {
    int  a; 
  void add(int x) { 
      a  +=  x; 
    } 
  void add(float f) { 
   a += ((int) f); 
    } 
  void add(number n) { 
   a += n.get_a(); 
    } 
  int get_a() { 
   return a; 
    } 
}


/*
Βλέπουμε δηλαδή ότι η συνάρτηση void add(...) χρησιμοποιείται πολλές φορές (3) 
αλλά κάθε φορά με διαφορετική λίστα παραμέτρων. Αυτή η επαναχρησιμοποίηση του ίδιου
ονόματος λέγεται υπερφόρτωση (overloading) του ονόματος αυτού. 
Στις  object oriented γλώσσες  επιτρέπεται ο ορισμός μίας μεθόδου με τι ίδιο όνομα
δύο ή περισσότερες φορές αρκεί να έχουν διαφορετικές λίστες παραμέτρων. Παράδειγμα : 
aMethod(), aMethod(type1), aMethod(type2), aMethod(type1, type2), aMethod(type2, type1). 
Όλες οι παραπάνω μέθοδοι είναι διαφορετικές μεταξύ τους.  Έτσι,  κατά την κλήση
μιας μεθόδου κατ'  αρχήν εξετάζεται το όνομά της και έπειτα εξετάζεται και η λίστα των
παραμέτρων της, όσον αφορά το πλήθος, τον τύπο και τη σειρά των παραμέτρων. Αυτό είναι
μια μορφή πολυμορφισμού.
/*